mazent/STM32/Lib/cmsis_rtos/cmsis_os_freertos.c
/*
 * Tutorial: https://os.mbed.com/handbook/CMSIS-RTOS
 * API: https://arm-software.github.io/CMSIS_5/RTOS/html/group__CMSIS__RTOS.html
 */

#define STAMPA_DBG          1
#include "utili.h"

#include "cmsis_os.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"
#include "semphr.h"

#include "stm32h7xx_hal.h"

static bool xPortInIsrContext(void)
{
    return __get_IPSR() != 0 ;
}

static TickType_t ms_in_tick(uint32_t millisec)
{
    TickType_t ticks ;

    static_assert(portTICK_PERIOD_MS, "OKKIO") ;

    if ( millisec == osWaitForever ) {
        ticks = portMAX_DELAY ;
    }
    else if ( 0 == millisec ) {
        ticks = 0 ;
    }
    else {
        // Rounding
        ticks = 1 + (millisec - 1) / portTICK_PERIOD_MS ;
        if ( 0 == ticks ) {
            ticks = 1 ;
        }
    }

    return ticks ;
}

#if configMAX_PRIORITIES == 3
static unsigned portBASE_TYPE freeRtos_pri(osPriority priority)
{
    switch ( priority ) {
    case osPriorityIdle:
    case osPriorityLow:
        return tskIDLE_PRIORITY ;

    case osPriorityBelowNormal:
    case osPriorityNormal:
    case osPriorityAboveNormal:
        return tskIDLE_PRIORITY + 1 ;

    case osPriorityHigh:
    case osPriorityRealtime:
        return tskIDLE_PRIORITY + 2 ;

    default:
        DBG_ERR ;
        return tskIDLE_PRIORITY ;
    }
}

#else
static unsigned portBASE_TYPE freeRtos_pri(osPriority priority)
{
    ASSERT(configMAX_PRIORITIES >= 7) ;

    switch ( priority ) {
    case osPriorityIdle:
        return tskIDLE_PRIORITY ;
    case osPriorityLow:
        return tskIDLE_PRIORITY + 1 ;
    case osPriorityBelowNormal:
        return tskIDLE_PRIORITY + 2 ;
    case osPriorityNormal:
        return tskIDLE_PRIORITY + 3 ;
    case osPriorityAboveNormal:
        return tskIDLE_PRIORITY + 4 ;
    case osPriorityHigh:
        return tskIDLE_PRIORITY + 5 ;
    case osPriorityRealtime:
        return tskIDLE_PRIORITY + 6 ;
    default:
        DBG_ERR ;
        return tskIDLE_PRIORITY ;
    }
}

#endif

static osMessageQId queue_create_and_register(
    const UBaseType_t uxQueueLength,
    const UBaseType_t uxItemSize,
    const char * nome)
{
    QueueHandle_t q = xQueueCreate(uxQueueLength, uxItemSize) ;
#if (configQUEUE_REGISTRY_SIZE > 0)
    vQueueAddToRegistry(q, nome) ;
#else
    INUTILE(nome) ;
#endif
    return q ;
}

//  ==== Kernel Control Functions ====

osStatus osKernelInitialize(void)
{
    return osOK ;
}

osStatus osKernelStart(void)
{
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }

    vTaskStartScheduler() ;

    return osOK ;
}

///// Check if the RTOS kernel is already started.
///// \note MUST REMAIN UNCHANGED: \b osKernelRunning shall be consistent in every CMSIS-RTOS.
///// \return 0 RTOS is not started, 1 RTOS is started.
//int32_t osKernelRunning(void);

#if (defined (osFeature_SysTick) && (osFeature_SysTick != 0 ) )       // System Timer available

uint32_t osKernelSysTick(void)
{
    if ( xPortInIsrContext() ) {
        return xTaskGetTickCountFromISR() ;
    }

    return xTaskGetTickCount() ;
}

///// The RTOS kernel system timer frequency in Hz
///// \note Reflects the system timer setting and is typically defined in a configuration file.
//#define osKernelSysTickFrequency 100000000
//
///// Convert a microseconds value to a RTOS kernel system timer value.
///// \param         microsec     time value in microseconds.
///// \return time value normalized to the \ref osKernelSysTickFrequency
//#define osKernelSysTickMicroSec(microsec) (((uint64_t)microsec * (osKernelSysTickFrequency)) / 1000000)
//
#endif    // System Timer available

//  ==== Memory (extension) ====

void * ose_malloc(size_t dim)
{
    if ( dim ) {
        return pvPortMalloc(dim) ;
    }

    return NULL ;
}

void ose_free(void * v)
{
    if ( v ) {
        vPortFree(v) ;
    }
}

//  ==== Thread Management ====

osThreadId osThreadCreate(
    const osThreadDef_t * td,
    void * argument)
{
    TaskHandle_t handle ;
    uint32_t ss = td->stacksize ;

    // 0 -> dimensione minima
    if ( 0 == ss ) {
        ss = configMINIMAL_STACK_SIZE * sizeof(StackType_t) ;
    }
    // Converto la dimensione dello stack da byte a freertos
    ss = (ss + sizeof(StackType_t) - 1) / sizeof(StackType_t) ;

    if ( xTaskCreate(td->pthread,
                     td->nome,
                     ss,
                     argument,
                     freeRtos_pri(td->tpriority),
                     &handle) != pdPASS ) {
        return NULL ;
    }

    return handle ;
}

#if ( ( INCLUDE_xTaskGetCurrentTaskHandle == 1) || (configUSE_MUTEXES == 1 ) )
osThreadId osThreadGetId(void)
{
    return xTaskGetCurrentTaskHandle() ;
}

#endif

#if (INCLUDE_vTaskDelete == 1)
osStatus osThreadTerminate(osThreadId thread_id)
{
    vTaskDelete(thread_id) ;

    return osOK ;
}

#endif

osStatus osThreadYield(void)
{
    taskYIELD() ;

    return osOK ;
}

///// Change priority of an active thread.
///// \param[in]     thread_id     thread ID obtained by \ref osThreadCreate or \ref osThreadGetId.
///// \param[in]     priority      new priority value for the thread function.
///// \return status code that indicates the execution status of the function.
///// \note MUST REMAIN UNCHANGED: \b osThreadSetPriority shall be consistent in every CMSIS-RTOS.
//osStatus osThreadSetPriority (osThreadId thread_id, osPriority priority);
//
///// Get current priority of an active thread.
///// \param[in]     thread_id     thread ID obtained by \ref osThreadCreate or \ref osThreadGetId.
///// \return current priority value of the thread function.
///// \note MUST REMAIN UNCHANGED: \b osThreadGetPriority shall be consistent in every CMSIS-RTOS.
//osPriority osThreadGetPriority (osThreadId thread_id);

//  ==== Generic Wait Functions ====

osStatus osDelay(uint32_t millisec)
{
    if ( 0 == millisec ) {
        millisec = 1 ;
    }

    vTaskDelay( ms_in_tick(millisec) ) ;

    return osOK ;
}

#if (defined (osFeature_Wait) && (osFeature_Wait != 0 ) )       // Generic Wait available

///// Wait for Signal, Message, Mail, or Timeout.
///// \param[in] millisec          \ref CMSIS_RTOS_TimeOutValue or 0 in case of no time-out
///// \return event that contains signal, message, or mail information or error code.
///// \note MUST REMAIN UNCHANGED: \b osWait shall be consistent in every CMSIS-RTOS.
//osEvent osWait (uint32_t millisec);

#endif  // Generic Wait available

//  ==== Timer Management Functions ====

