mazent/STM32/Lib/cmsis_rtos/cmsis_os_freertos.c
typedef struct os_timer_cb {
    uint32_t milli ;
    TimerHandle_t h ;
    os_ptimer cb ;
    void * arg ;
} os_timer_id ;

static void timer_cb(TimerHandle_t xTimer)
{
    osTimerId pT = pvTimerGetTimerID(xTimer) ;

    ASSERT(xTimer == pT->h) ;

    pT->cb(pT->arg) ;
}

osTimerId osTimerCreate(
    const osTimerDef_t * timer_def,
    os_timer_type type,
    void * argument)
{
    os_timer_id * tid = NULL ;
    bool esito = false ;

    do {
        ASSERT( !xPortInIsrContext() ) ;
        if ( xPortInIsrContext() ) {
            break ;
        }

        ASSERT(timer_def) ;
        if ( NULL == timer_def ) {
            break ;
        }

        ASSERT(timer_def->ptimer) ;
        if ( NULL == timer_def->ptimer ) {
            break ;
        }

        tid = pvPortMalloc( sizeof(os_timer_id) ) ;
        if ( NULL == tid ) {
            break ;
        }

        tid->milli = 100 ;
        tid->cb = timer_def->ptimer ;
        tid->arg = argument ;
        tid->h = xTimerCreate(
            timer_def->nome,
            ms_in_tick(tid->milli),
            (type == osTimerPeriodic) ? pdTRUE : pdFALSE,
            tid,
            timer_cb) ;
        if ( NULL == tid->h ) {
            break ;
        }

        esito = true ;
    } while ( false ) ;

    if ( !esito ) {
        if ( tid ) {
            vPortFree(tid) ;
            tid = NULL ;
        }
    }

    return tid ;
}

osStatus osTimerStart(
    osTimerId timer_id,
    uint32_t millisec)
{
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }

    if ( millisec != timer_id->milli ) {
        if ( pdPASS ==
             xTimerChangePeriod(timer_id->h, ms_in_tick(millisec), 0) ) {
            timer_id->milli = millisec ;
        }
        else {
            DBG_ERR ;
            return osErrorOS ;
        }
    }

    if ( pdPASS == xTimerStart(timer_id->h, 0) ) {
        return osOK ;
    }

    DBG_ERR ;
    return osErrorParameter ;
}

osStatus osTimerStop(osTimerId timer_id)
{
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( pdPASS == xTimerStop(timer_id->h, 0) ) {
        return osOK ;
    }

    DBG_ERR ;
    return osErrorParameter ;
}

osStatus osTimerDelete(osTimerId timer_id)
{
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( pdPASS == xTimerDelete(timer_id->h, 0) ) {
        vPortFree(timer_id) ;

        return osOK ;
    }

    DBG_ERR ;
    return osErrorParameter ;
}

//  ==== Signal Management ====

osStatus osSignalSet(
    osThreadId thread_id,
    int32_t signal)
{
    ASSERT(signal >= 0) ;
    if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( xTaskNotifyFromISR(thread_id, (uint32_t) signal, eSetBits,
                                &xHigherPriorityTaskWoken) != pdPASS ) {
            DBG_ERR ;
            return osErrorOS ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else if ( xTaskNotify(thread_id, (uint32_t) signal, eSetBits) != pdPASS ) {
        DBG_ERR ;
        return osErrorOS ;
    }

    return osOK ;
}

osEvent osSignalWait(
    int32_t signals,
    uint32_t millisec)
{
    osEvent evn = {
        .status = osOK
    } ;
    TickType_t ticks = ms_in_tick(millisec) ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        evn.status = osErrorISR ;
    }
    else {
        ASSERT(signals >= 0) ;
        if ( 0 == signals ) {
            signals = NEGA(0x80000000) ;
        }

        if ( xTaskNotifyWait(
                 0, // ulBitsToClearOnEntry: non cancello niente quando mi metto in attesa
                 (uint32_t) signals,
                 (uint32_t *) &evn.value.signals,
                 ticks) != pdTRUE ) {
            evn.status = osEventTimeout ;
        }
        else if ( evn.value.signals < 0 ) {
            DBG_ERR ;
            evn.status = osErrorValue ;
        }
        else {
            evn.status = osEventSignal ;
        }
    }

    return evn ;
}

//  ==== Mutex Management ====

osMutexId osMutexCreate(const osMutexDef_t * mutex_def)
{
    INUTILE(mutex_def) ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return NULL ;
    }

    return xSemaphoreCreateMutex() ;
}

osStatus osMutexWait(
    osMutexId mutex_id,
    uint32_t millisec)
{
    ASSERT(mutex_id) ;
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( NULL == mutex_id ) {
        return osErrorParameter ;
    }

    TickType_t attesa = ms_in_tick(millisec) ;

    return pdTRUE ==
           xSemaphoreTake(mutex_id, attesa) ?
           osOK : osErrorTimeoutResource ;
}

osStatus osMutexRelease(osMutexId mutex_id)
{
    ASSERT(mutex_id) ;
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( NULL == mutex_id ) {
        return osErrorParameter ;
    }

    return pdTRUE ==
           xSemaphoreGive(mutex_id) ?
           osOK : osErrorResource ;
}

osStatus osMutexDelete(osMutexId mutex_id)
{
    ASSERT(mutex_id) ;
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( NULL == mutex_id ) {
        return osErrorParameter ;
    }

    vSemaphoreDelete(mutex_id) ;

    return osOK ;
}

//  ==== Semaphore Management Functions ====

#if (defined (osFeature_Semaphore) && (osFeature_Semaphore != 0 ) )       // Semaphore available

osSemaphoreId osSemaphoreCreate(
    const osSemaphoreDef_t * semaphore_def,
    int32_t count)
{
    INUTILE(semaphore_def) ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return NULL ;
    }
    if ( count == 1 ) {
        osSemaphoreId sema ;
        vSemaphoreCreateBinary(sema) ;
        return sema ;
    }

    return xSemaphoreCreateCounting(count, count) ;
}

int32_t osSemaphoreWait(
    osSemaphoreId semaphore_id,
    uint32_t millisec)
{
    ASSERT(semaphore_id) ;
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( NULL == semaphore_id ) {
        return osErrorParameter ;
    }

    TickType_t attesa = ms_in_tick(millisec) ;

