mazent/STM32/Lib/cmsis_rtos/cmsis_os_freertos.c
    return pdTRUE ==
           xSemaphoreTake(semaphore_id, attesa) ?
           osOK : osErrorTimeoutResource ;
}

osStatus osSemaphoreRelease(osSemaphoreId semaphore_id)
{
    ASSERT(semaphore_id) ;

    if ( NULL == semaphore_id ) {
        return osErrorParameter ;
    }
    if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( xSemaphoreGiveFromISR(semaphore_id,
                                   &xHigherPriorityTaskWoken) != pdTRUE ) {
            DBG_ERR ;
            return osErrorResource ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        if ( xSemaphoreGive(semaphore_id) != pdTRUE ) {
            DBG_ERR ;
            return osErrorResource ;
        }
    }
    return osOK ;
}

osStatus osSemaphoreDelete(osSemaphoreId semaphore_id)
{
    ASSERT(semaphore_id) ;
    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return osErrorISR ;
    }
    if ( NULL == semaphore_id ) {
        return osErrorParameter ;
    }

    vSemaphoreDelete(semaphore_id) ;

    return osOK ;
}

#endif     // Semaphore available

//  ==== Memory Pool Management Functions ====

#if (defined (osFeature_Pool) && (osFeature_Pool != 0 ) )    // Memory Pool Management available

/*
             free  +--------+
           -------->        |
      API    alloc | liberi |
           <-------+        |
                   +--------+
*/

typedef struct os_pool_cb {
    QueueHandle_t liberi ;
    size_t dim_elem ;
    uint8_t * mem ;
} os_pool_cb_t ;

osPoolId osPoolCreate(const osPoolDef_t * pool_def)
{
    osPoolId pid = NULL ;
    os_pool_cb_t tmp = {
        .dim_elem = pool_def->item_sz
    } ;
    uint8_t * mem = NULL ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        goto err1 ;
    }

    tmp.liberi = queue_create_and_register(pool_def->pool_sz,
                                           sizeof(void *),
                                           pool_def->nome) ;
    ASSERT(tmp.liberi) ;
    if ( NULL == tmp.liberi ) {
        goto err1 ;
    }

    tmp.mem = pvPortMalloc(pool_def->pool_sz * pool_def->item_sz) ;
    ASSERT(tmp.mem) ;
    if ( NULL == tmp.mem ) {
        goto err2 ;
    }

    // All'inizio tutti i buffer sono liberi
    mem = tmp.mem ;
    for ( uint32_t i = 0 ; i < pool_def->pool_sz ;
          i++, mem += pool_def->item_sz ) {
        (void) xQueueSend(tmp.liberi, &mem, 0) ;
    }

    pid = pvPortMalloc( sizeof(os_pool_cb_t) ) ;
    ASSERT(pid) ;
    if ( NULL == pid ) {
        goto err3 ;
    }

    *pid = tmp ;
    goto err1 ;

err3:
    vPortFree(tmp.mem) ;
err2:
    vQueueDelete(tmp.liberi) ;
err1:
    return pid ;
}

void * osPoolAlloc(osPoolId pool_id)
{
    void * buf = NULL ;

    ASSERT(pool_id) ;
    if ( NULL == pool_id ) {}
    else if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( pdFAIL ==
             xQueueReceiveFromISR(pool_id->liberi, &buf,
                                  &xHigherPriorityTaskWoken) ) {
            buf = NULL ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        (void) xQueueReceive(pool_id->liberi, &buf, 0) ;
    }

    return buf ;
}

void * osPoolCAlloc(osPoolId pool_id)
{
    void * buf = osPoolAlloc(pool_id) ;
    if ( buf ) {
        memset_(buf, 0, pool_id->dim_elem) ;
    }

    return buf ;
}

osStatus osPoolFree(
    osPoolId pool_id,
    void * buf)
{
    ASSERT(pool_id) ;
    ASSERT(buf) ;

    if ( NULL == pool_id ) {
        return osErrorParameter ;
    }
    if ( NULL == buf ) {
        return osErrorParameter ;
    }
    if ( xPortInIsrContext() ) {
        osStatus esito = osOK ;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( pdTRUE !=
             xQueueSendFromISR(pool_id->liberi, &buf,
                               &xHigherPriorityTaskWoken) ) {
            DBG_ERR ;
            esito = osErrorOS ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;

        return esito ;
    }
    if ( pdTRUE == xQueueSend(pool_id->liberi, &buf, 0) ) {
        return osOK ;
    }

    DBG_ERR ;
    return osErrorOS ;
}

#endif   // Memory Pool Management available

//  ==== Message Queue Management Functions ====

#if (defined (osFeature_MessageQ) && (osFeature_MessageQ != 0 ) )       // Message Queues available

osMessageQId osMessageCreate(
    const osMessageQDef_t * queue_def,
    osThreadId thread_id)
{
    INUTILE(thread_id) ;

    ASSERT( !xPortInIsrContext() ) ;
    if ( xPortInIsrContext() ) {
        return NULL ;
    }

    return queue_create_and_register(queue_def->queue_sz,
                                     queue_def->item_sz,
                                     queue_def->nome) ;
}

osStatus osMessagePut(
    osMessageQId queue_id,
    uint32_t info,
    uint32_t millisec)
{
    TickType_t ticks = ms_in_tick(millisec) ;

    ASSERT(queue_id) ;

    if ( queue_id == NULL ) {
        return osErrorParameter ;
    }
    if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( xQueueSendFromISR(queue_id, &info,
                               &xHigherPriorityTaskWoken) != pdTRUE ) {
            DBG_ERR ;
            return osErrorResource ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        if ( xQueueSend(queue_id, &info, ticks) != pdTRUE ) {
            DBG_ERR ;
            return osErrorResource ;
        }
    }

    return osOK ;
}

osEvent osMessageGet(
    osMessageQId queue_id,
    uint32_t millisec)
{
    TickType_t ticks = ms_in_tick(millisec) ;
    osEvent event ;

    ASSERT(queue_id) ;

    event.def.message_id = queue_id ;
    event.value.v = 0 ;

    if ( queue_id == NULL ) {
        event.status = osErrorParameter ;
        return event ;
    }

    if ( xPortInIsrContext() ) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE ;

        if ( xQueueReceiveFromISR(queue_id, &event.value.v,
                                  &xHigherPriorityTaskWoken) == pdTRUE ) {
            /* We have mail */
            event.status = osEventMessage ;
        }
        else {
            event.status = osOK ;
        }
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        if ( xQueueReceive(queue_id, &event.value.v, ticks) == pdTRUE ) {
            /* We have mail */
            event.status = osEventMessage ;
        }
        else {
            event.status = (ticks == 0) ? osOK : osEventTimeout ;
        }
    }

